{
  "branchName": "fix/sidebar-fix-and-search-repair",
  "title": "Sidebar Safe Area Fix & Search Backend Repair",
  "userStories": [
    {
      "id": "US-013",
      "title": "Fix sidebar height to respect PlayerBar safe area",
      "description": "As a user, I want the sidebar's bottom section (guild name and collapse button) to be visible and clickable at all times, so I can always collapse the sidebar or see which server I'm in.",
      "passes": true,
      "acceptanceCriteria": [
        "The sidebar's guild info row and collapse toggle button are fully visible above the PlayerBar",
        "No sidebar content is occluded by the 80px PlayerBar at the bottom of the viewport",
        "Fix is achieved by changing Sidebar.tsx sidebar height from 100vh to calc(100vh - 80px)",
        "Collapsed and expanded sidebar states both work correctly",
        "Typecheck passes"
      ]
    },
    {
      "id": "US-014",
      "title": "Replace yt-dlp YouTube search with YouTube Data API v3",
      "description": "As a user, I want to search for songs by name and get results, so I can add them to the queue.",
      "passes": false,
      "acceptanceCriteria": [
        "YOUTUBE_API_KEY is added to .env.example with a descriptive comment",
        "AudioResolver.search() in bot/audio/resolver.py uses the YouTube Data API v3 when YOUTUBE_API_KEY is set in the environment",
        "Results include: title, url (full youtube.com/watch?v=... URL), duration (seconds, int), thumbnail (URL)",
        "The YouTube API call is made with urllib (sync) to avoid new dependencies",
        "Typecheck passes"
      ]
    },
    {
      "id": "US-015",
      "title": "Add SoundCloud fallback when YouTube search is unavailable",
      "description": "As a user, I want search to still return results even if the YouTube API key is not configured, so I can use the bot out of the box.",
      "passes": false,
      "acceptanceCriteria": [
        "When YOUTUBE_API_KEY is not set, AudioResolver.search() falls back to SoundCloud search via yt-dlp using scsearch{max_results}:{query}",
        "When YOUTUBE_API_KEY is set but the YouTube API call raises an exception, AudioResolver.search() logs a warning and falls back to SoundCloud search",
        "Results from the SoundCloud fallback have the same shape: title, url, duration, thumbnail",
        "Typecheck passes"
      ]
    },
    {
      "id": "US-016",
      "title": "Surface search errors as a clear 'Search unavailable' message on the frontend",
      "description": "As a user, I want to see a friendly error message when search fails, so I know something is wrong rather than seeing a blank screen.",
      "passes": false,
      "acceptanceCriteria": [
        "handle_search() in bot/api/search.py wraps resolver.search() in a try/except; on any exception it returns HTTP 503 with {\"error\": \"Search unavailable\"} JSON body",
        "SearchBar.tsx catches the error from searchYouTube() and sets the error state to \"Search unavailable. Please try again later.\"",
        "The error message is displayed in the existing <p style={styles.error}> element",
        "Typecheck passes"
      ]
    }
  ]
}
